case/precFlowCylinder/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
     }
    cylinder
    {
        type            fixedFluxPressure;
        value           $internalField;
     }
    frontAndBack
    {
        type            fixedFluxPressure;
        value           $internalField;

    }
//    back 
//    {
//        type            fixedFluxPressure;
//        value           $internalField;
//    }
}


// ************************************************************************* //
